# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 12  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# TopFormer v1.0 backbone
backbone:
  # [from, number, module, args]
  # args = c, k, s, t
  [[-1, 1, Conv, [16, 3, 2]],                  # 0-P1/2   0
   [-1, 1, InvertedResidual, [16,  3, 1, 1]],
   [-1, 1, InvertedResidual, [32,  3, 2, 4]],  # 1-P2/4   2
   [-1, 1, InvertedResidual, [32,  3, 1, 3]],
   [-1, 1, InvertedResidual, [64,  5, 2, 3]],  # 3-P3/8   4
   [-1, 1, InvertedResidual, [64,  5, 1, 3]],
   [-1, 1, InvertedResidual, [128, 3, 2, 3]],  # 5-P4/16  6
   [-1, 1, InvertedResidual, [128, 3, 1, 3]],
   [-1, 1, InvertedResidual, [160, 5, 2, 6]],  # 7-P5/32  8
   [-1, 1, InvertedResidual, [160, 5, 1, 6]],
   [-1, 1, InvertedResidual, [160, 3, 1, 6]],  #          10
  ]

# TopFormer v1.0 head
head:
  [
    [[-1, -5, -7, -9], 1, PyramidPoolAgg, []],  # ppa      11
    [-1, 1, TopFormer_Block,              []],  # trans    12
    [[3, 5, 7, 10, -1], 1, LocalGlobalFuse, [[1, 2, 3], [32, 64, 128, 160]]],
    [[-1, -2, -3], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]
