# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 20  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple
#anchors:
#  - [10,13, 16,30, 33,23]  # P3/8
#  - [30,61, 62,45, 59,119]  # P4/16
#  - [116,90, 156,198, 373,326]  # P5/32

anchors:
  - [12.8,21.33, 25.6,37.93, 35.2,75.73]  # P3/8
  - [54.4,121.6, 59.73,49.92, 82.13,81.78]  # P4/16
  - [87.62,163.81, 136.0,112.0, 147.94,216.89]  # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  # Shuffle_Block: [out, stride]
  [[ -1, 1, conv_bn_relu_maxpool, [ 32 ] ], # 0-P2/4
   [ -1, 1, Shuffle_Block, [ 116, 2 ] ],  # 1-P3/8
   [ -1, 3, Shuffle_Block, [ 116, 1 ] ],  # 2
   [ -1, 1, Shuffle_Block, [ 232, 2 ] ],  # 3-P4/16
   [ -1, 7, Shuffle_Block, [ 232, 1 ] ],  # 4
   [ -1, 1, Shuffle_Block, [ 464, 2 ] ],  # 5-P5/32
   [ -1, 3, Shuffle_Block, [ 464, 1 ] ],  # 6
   [ -1, 3, CBAM, [464]],      # 7
  ]

# YOLOv5 v6.0 head
head:
  [[-1, 1, GSConv, [128, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 4], 1, Concat, [1]],  # cat backbone P4
   [-1, 1, C3, [128, False]],  # 11

   [-1, 1, GSConv, [64, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 2], 1, Concat, [1]],  # cat backbone P3
   [-1, 1, C3, [64, False]],  # 15 (P3/8-small)

   [-1, 1, GSConv, [64, 3, 2]],
   [[-1, 11], 1, Concat, [1]],  # cat head P4
   [-1, 1, C3, [128, False]],  # 18 (P4/16-medium)

   [-1, 1, GSConv, [128, 3, 2]],
   [[-1, 7], 1, Concat, [1]],  # cat head P5
   [-1, 1, C3, [256, False]],  # 21 (P5/32-large)

   [[15, 18, 21], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]
